/* 题目 */
/* 阳虚质--阴虚质--气虚质--痰湿质--湿热质--血瘀质--特禀质--气郁质--平和质 */
/*
 * let question = [
 * [['分数','问题']]
 * ]
 * */
export function question() {
  return [
    [['5', '您手脚发凉吗？'],
      ['5', '您胃脘部、背部或腰膝部怕冷吗？'],
      ['5', '您感到怕冷、衣服比别人穿得多吗？'],
      ['5', '您比一般人耐受不了寒冷（冬天的寒冷、夏天的冷空调、电扇等）吗？'],
      ['5', '您比别人容易患感冒吗？'],
      ['5', '您吃（喝）凉的东西会感到不舒服或者怕吃（喝）凉东西吗？'],
      ['5', '您受凉或吃（喝）凉的东西后，容易腹泻（拉肚子）吗？']
    ],
    [['5', '您感到手脚心发热吗？'],
      ['5', '您感觉身体、脸上发热吗？'],
      ['5', '您皮肤或口唇干吗？'],
      ['5', '您口唇的颜色比一般人红吗？ '],
      ['5', '您容易便秘或大便干燥吗？'],
      ['5', '您面部两颧潮红或偏红吗？'],
      ['5', '您感到眼睛干涩吗？'],
      ['5', '您感到口干咽燥、总想喝水吗？']
    ],
    [['5', '您容易疲乏吗？'],
      ['5', '您容易气短（呼吸短促，接不上气）吗？'],
      ['5', '您容易心慌吗？'],
      ['5', '您容易头晕或站起时晕眩吗？'],
      ['5', '您比别人容易患感冒吗？'],
      ['5', '您喜欢安静、懒得说话吗？'],
      ['5', '您说话声音低弱无力吗？'],
      ['5', '您活动量稍大就容易出虚汗吗？']
    ],
    [['5', '您感到胸闷或腹部胀满吗？'],
      ['5', '您感到身体沉重不轻松或不爽快吗？'],
      ['5', '您腹部肥满松软吗？'],
      ['5', '您有额部油脂分泌多的现象吗？'],
      ['5', '您上眼睑比别人肿（上眼睑有轻微隆起现象）吗？'],
      ['5', '您嘴里有黏黏的感觉吗？'],
      ['5', '您平时痰多，特别是咽喉部总感到有痰堵着吗？'],
      ['5', '您舌苔厚腻或有舌苔厚厚的感觉吗？']
    ],
    [['5', '您面部或鼻部有油腻感或者油亮发光吗？'],
      ['5', '您容易生痤疮或疮疖吗？'],
      ['5', '您感到口苦或嘴里有异味吗？'],
      ['5', '您大便黏滞不爽、有解不尽的感觉吗？'],
      ['5', '您小便时尿道有发热感、尿色浓（深）吗？'],
      ['5', '您带下色黄（白带颜色发黄）吗？（限女性回答）'] /* '您的阴囊部位潮湿吗？（限男性回答）' */
    ],
    [['5', '您的皮肤在不知不觉中会出现青紫瘀斑（皮下出血）吗？'],
      ['5', '您两颧部有细微红丝吗？'],
      ['5', '您身体上有哪里疼痛吗？'],
      ['5', '您面色晦黯或容易出现褐斑吗？'],
      ['5', '您容易有黑眼圈吗？'],
      ['5', '您容易忘事（健忘）吗？'],
      ['5', '您口唇颜色偏黯吗？']
    ],
    [['5', '您没有感冒时也会打喷嚏吗？'],
      ['5', '您没有感冒时也会鼻塞、流鼻涕吗？'],
      ['5', '您有因季节变化、温度变化或异味等原因而咳喘的现象吗？'],
      ['5', '您容易过敏（对药物、食物、气味、花粉或在季节交替、气候变化时）吗？'],
      ['5', '您的皮肤容易起荨麻疹（风团、风疹块、风疙瘩）吗？'],
      ['5', '您的皮肤因过敏出现过紫癜（紫红色瘀点、瘀斑）吗？'],
      ['5', '您的皮肤一抓就红，并出现抓痕吗？']
    ],
    [['5', '您感到闷闷不乐、情绪低沉吗？'],
      ['5', '您容易精神紧张、焦虑不安吗？'],
      ['5', '您多愁善感、感情脆弱吗？'],
      ['5', '您容易感到害怕或受到惊吓吗？'],
      ['5', '您胁肋部或乳房胀痛吗？'],
      ['5', '您无缘无故叹气吗？'],
      ['5', '您咽喉部有异物感，且吐之不出、咽之不下吗？']
    ],
    [['-1', '您精力充沛吗？'],
      ['-1', '您容易疲乏吗？'],
      ['-1', '您说话声音低弱无力吗？'],
      ['-1', '您感到闷闷不乐、情绪低沉吗？'],
      ['-1', '您比一般人耐受不了寒冷（冬天的寒冷，夏天的冷空调、电扇等）吗？'],
      ['-1', '您能适应外界自然和社会环境的变化吗？'],
      ['-1', '您容易失眠吗？'],
      ['-1', '您容易忘事（健忘）吗？']
    ]
  ];
}

// 测试结果显示
/* 阳虚质--阴虚质--气虚质--痰湿质--湿热质--血瘀质--特禀质--气郁质--平和质 */
export function result() {
  return {
    yangxuzhi: {
      // 阳虚质
      name: '【阳虚质】',
      desc: '肌肉松软，畏寒怕冷，手脚冰凉',
      commonPerformance: '<span>【常见表现】</span>形体多白胖，肌肉不壮，平素畏冷，手脚冰凉，喜热饮食，精神不振，睡眠偏多，口唇色淡，易出汗，大便稀薄，小便清长。',
      detail: [
        '<span>【心理特征】</span>内向沉静',
        '<span>【发病倾向】</span>易患风寒感冒、鼻炎、痛经、阳痿、风湿关节炎、宫寒不孕、泄泻、水肿等，耐夏不耐冬，易感风、寒、湿邪。'
      ],
      suggest: {
        title: '饮食以温补为主，劳逸结合，适当运动',
        desc: [
          '【饮食】多吃温阳益气的食物，如牛肉、羊肉、韭菜、生姜、辣椒、葱、蒜、芥末、花椒等，少吃梨、西瓜、荸荠、黄瓜、柿子、冷饮、雪糕等生冷寒凉的食物。',
          '【起居】避开阴冷潮湿环境，注意保暖，尤其是足下、背部及下腹丹田部位的防寒保暖。',
          '【运动】宜选择上午、春夏季节运动，不宜游泳，避免在极端天气下运动，防止出汗过多。'
        ]
      }
    },
    yinxuzhi: {
      // 阴虚质
      name: '【阴虚质】',
      desc: '脾气急躁，手足心热，口燥咽干',
      commonPerformance: '<span>【常见表现】</span>体型偏瘦，面色潮红、有烘热感，手足心热，口燥咽干，双眼干涩，唇红微干，皮肤偏干，易生皱纹，口渴喜冷饮，眩晕耳鸣，睡眠差，大便干燥，小便短涩。',
      detail: [
        '<span>【心理特征】</span>性格急躁，外向好动。',
        '<span>【发病倾向】</span>易患失眠、便秘、阴虚咳嗽、复发性口疮等，耐冬不耐夏，易受暑、热、燥邪。'
      ],
      suggest: {
        title: '饮食以滋阴为主，不要熬夜，适当进行有氧运动。',
        desc: [
          '【饮食】饮食以滋阴降火为原则，多吃瘦猪肉、鸭肉、龟、鳖、绿豆、冬瓜、赤小豆、海蜇、荸荠、芝麻、百合等甘淡清润之品。少吃羊肉、狗肉、韭菜、辣椒、葱、蒜等性温燥烈之品。',
          '【起居】宜居安静环境，不可熬夜，不宜蒸桑拿。',
          '【运动】避免剧烈运动，适合强度较低的有氧运动，如散步、做体操、慢跑等，注意及时补充水分。'
        ]
      }
    },
    qixuzhi: {
      // 气虚质
      name: '【气虚质】',
      desc: '气短懒言，容易疲劳，免疫力低下。',
      commonPerformance: '<span>【常见表现】</span>肌肉松软，面色偏黄或白，说话语音低弱，气短懒言，容易疲乏，精神不振，易出汗，双目无神，唇无血色，毛发无光泽，头晕健忘，大便一般正常，小便正常或偏多。',
      detail: [
        '<span>【心理特征】</span>性格内向，情绪不稳定，胆小怕事，不喜欢冒险。',
        '<span>【发病倾向】</span>易患感冒、内脏下垂、鼻炎等，病后康复缓慢，不耐受风、寒、暑邪。'
      ],
      suggest: {
        title: '饮食以益气健脾为主，保持充足睡眠，运动强度不宜过大。',
        desc: [
          '【饮食】多吃益气健脾、易于消化的食物，如山药、黄豆、白扁豆、鸡肉、香菇、大枣、蜂蜜等。少吃耗气的食物，如空心菜、生萝卜等。不可贪吃生冷食物。',
          '【起居】起居宜有规律，注意保暖，午间应适当休息，保持充足睡眠。',
          '【运动】适合进行低强度的运动，如打太极拳、散步、骑自行车等，注意避免劳动或运动时出汗受风。'
        ]
      }
    },
    yanshizhi: {
      // 痰湿质
      name: '【痰湿质】',
      desc: '体型肥胖，腹部肥软，油光满面。',
      commonPerformance: '<span>【常见表现】</span>体形肥胖，腹部肥满松软，面色淡黄而暗，眼泡微浮，面部皮肤油脂较多，多汗且粘，胸闷，痰多，身体困重易疲乏，口舌黏腻，大便正常或不实，小便不多或微混。',
      detail: [
        '<span>【心理特征】</span>性格温和、稳重，多善于忍耐。',
        '<span>【发病倾向】</span>易患糖尿病、中风、冠心病、脂肪肝、前列腺炎、肥胖症等，不耐受湿邪，对梅雨季节及湿重环境适应能力差。'
      ],
      suggest: {
        title: '清淡饮食，居住环境宜干爽，多参加户外运动。',
        desc: [
          '【饮食】饮食以清淡、健脾利湿为主，一定要控制甜食和油腻食物。可多吃海带、冬瓜、薏米、赤小豆、芡实等。冬瓜有利尿、祛痰的功效，夏季常食还可以清热解毒。',
          '【起居】居住环境宜干燥清爽，不要在潮湿环境久留。',
          '【运动】多进行户外运动，适合中小强度、长时间的运动，如散步、慢跑、打乒乓球、游泳等。'
        ]
      }
    },
    shirezhi: {
      // 湿热质
      name: '【湿热质】',
      desc: '面垢油光，易长痘痘，口苦口臭。',
      commonPerformance: '<span>【常见表现】</span>体型中等或偏瘦，面垢油光，易生痤疮粉刺，口苦口干口臭，身重困倦，心烦懈怠，眼睛红赤，大便燥结或黏滞，小便短赤，男性易阴囊潮湿，女性易带下增多。',
      detail: [
        '<span>【心理特征】</span>心烦，急躁易怒。',
        '<span>【发病倾向】</span>易患痤疮、疮疔、痔疮、脂溢性脱发、带下过多、肝炎、膀胱炎等，对湿热、气温偏高环境较难适应。'
      ],
      suggest: {
        title: '清淡饮食，戒烟戒酒，不熬夜，居家宜干爽，加强运动锻炼。',
        desc: [
          '【饮食】戒烟戒酒，多吃清热利湿的食物，如绿豆、黄瓜、莲藕、冬瓜、赤小豆等，尤其是夏天。少吃羊肉、韭菜、辣椒、火锅、烧烤等辛温助热的食物，以免积蓄体内的湿热，诱发湿疹、痘痘等。',
          '【起居】居家宜清爽干燥，不要熬夜，多喝水。',
          '【运动】宜进行大强度、大运动量的运动项目，如长跑、马拉松、登山等。'
        ]
      }
    },
    xueyuzhi: {
      // 血瘀质
      name: '【血瘀质】',
      desc: '体瘦居多，面暗多斑，失眠健忘。',
      commonPerformance: '<span>【常见表现】</span>体型多瘦弱，面色晦暗，皮肤偏暗偏干，易长瘀斑，嘴唇、指甲颜色淡白或便紫，眼圈暗黑，易脱发，手足发麻，心悸头晕，失眠健忘，便秘，女性多见痛经、闭经。',
      detail: [
        '<span>【心理特征】</span>性情急躁，心情易烦。',
        '<span>【发病倾向】</span>易患心脑血管疾病、肿瘤、中风、失眠、血管神经性头痛、慢性疼痛疾病、黄褐斑、女性闭经等，不难受风、寒邪。'
      ],
      suggest: {
        title: '饮食以活血化瘀为主，作息有规律，加强体育锻炼。',
        desc: [
          '【饮食】多吃山楂、海带、玫瑰花、醋、金桔等具有活血、散结、行气、疏肝解郁作用的食物，少吃肥肉等滋腻食品。',
          '【起居】作息时间有规律，保持充足睡眠，日常生活不宜过于安逸，注意劳逸结合，有助于调畅气血。',
          '【运动】加强体育锻炼，多做有助于气血运行的运动，如舞蹈、步行、徒手操等。'
        ]
      }
    },
    tebingzhi: {
      // 特禀质
      name: '【特禀质】',
      desc: '遗传疾病，先天缺陷，容易过敏。',
      commonPerformance: '<span>【常见表现】</span>特殊人群，多有遗传疾病、胎传性疾病、过敏反应。常见哮喘、风团、咽痒、鼻塞、打喷嚏等，生理机能和自我调适力低下。先天禀赋异常者或有畸形，或有生理缺陷。',
      detail: [
        '<span>【心理特征】</span>随禀质不同而情况各异。',
        '<span>【发病倾向】</span>易患过敏性疾病，如过敏性鼻炎、过敏性紫癜、荨麻疹、哮喘等，遗传性疾病如血友病、先天愚型等，胎传性疾病如胎惊等，对环境适应能力差。'
      ],
      suggest: {
        title: '饮食宜益气固表，居室通风清洁，睡眠充足，加强锻炼，注意保暖。',
        desc: [
          '【饮食】饮食宜清淡、均衡，粗细搭配适当，荤素配伍合理。多吃益气固表的食物，如黄芪、山药、糯米等，少吃荞麦（含致敏物质荞麦荧光素）、蚕豆、白扁豆、牛肉、羊肉、鹅肉、鲤鱼、虾、蟹、茄子、浓茶、咖啡及酒、辣椒等辛辣、腥膻发物及含致敏物质的食物。必要时应根据个人实际过敏反应制定不同的保健食谱。',
          '【起居】居室应通风良好，避免过敏原，保持室内清洁，被褥、床单要经常洗晒，可防止对尘螨过敏。室内装修后不宜立即入住，让甲醛等挥发干净后再搬进新居。起居应有规律，保持充足的睡眠。',
          '【运动】积极参加各种体育锻炼，天气寒冷时锻炼要注意防寒保暖，防止感冒。'
        ]
      }
    },
    qiyuzhi: {
      // 气郁质
      name: '【气郁质】',
      desc: '体型偏瘦，敏感多疑，抑郁寡欢。',
      commonPerformance: '<span>【常见表现】</span>体型瘦者为多，面貌神情忧郁，情感脆弱，烦闷不乐，胸胁胀满或走窜疼痛，唉声叹气，睡眠较差，食欲减退，惊悸，健忘，大便偏干，小便正常。',
      detail: [
        '<span>【心理特征】</span>性格内向不稳定，忧郁脆弱，敏感多疑。',
        '<span>【发病倾向】</span>易患抑郁症、失眠、焦虑症、精神分裂症、胃肠神经官能症等，对精神刺激适应能力较差，不适应阴雨天气。'
      ],
      suggest: {
        title: '饮食宜宽胸理气，起居宜动不宜静，多参加社会活动、人际交往。',
        desc: [
          '【饮食】以理气解郁为主，多吃黄花菜、海带、山楂、玫瑰花等具有行气、解郁、消食、醒神作用的食物。',
          '【起居】居住环境不要过于嘈杂，也不要总待在家里，建议多点社会活动、人际交往。',
          '【运动】增加户外活动，如跑步、登山、游泳、武术等，让身心放轻松。'
        ]
      }
    },
    pinghezhi: {
      // 平和质
      name: '【平和质】',
      desc: '体态适中，面色红润，精力充沛。',
      commonPerformance: '<span>【常见表现】</span>体型匀称健壮，面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉通利，唇色红润，不易疲劳，耐受寒热，睡眠良好，胃口好，二便正常。',
      detail: [
        '<span>【心理特征】</span>性格随和开朗。',
        '<span>【发病倾向】</span>较少患病，适应能力较强。'
      ],
      suggest: {
        title: '饮食清淡为主，劳逸结合，适当运动。',
        desc: [
          '【饮食】注重膳食平衡，多吃五谷杂粮、蔬菜瓜果，远离烟酒。',
          '【起居】保持良好的生活习惯，作息有规律，劳逸结合。',
          '【运动】坚持适当的锻炼，如慢跑、游泳、打羽毛球、打太极拳等。'
        ]
      }
    },
  };
}
