<template>
<div class="PrivacyPolicy">
  <h1>隐私政策</h1>
  <div class="PrivacyPolicy-main">
    <div class="paragraph">
      <h2>欢迎您使用”药葫芦”软件及相关服务！</h2>
      <h3>康美药业股份有限公司（以下简称“我们”或“公司”）充分尊重和保护用户的个人隐私。我们将按照法律法规的规定，采用安全保护措施，保护您的个人信息及隐私安全。因此，我们制定《“药葫芦”隐私政策》（以下简称“本《隐私政策》”）并提醒您：在使用“药葫芦”软件及相关服务、提交个人信息前，请务必仔细阅读并透彻理解本《隐私政策》，在确认充分理解并同意后方使用相关产品和服务。如一旦您开始使用“药葫芦”软件及相关服务，则视为您对本政策内容的接受和认可。</h3>
      <h3>我们非常重视用户个人信息的保护，并且将以高度勤勉和审慎的义务对待这些信息。您在下载、安装、开启、浏览、注册、登录、使用（以下统称“使用”）“药葫芦”软件及相关服务时，我们将按照本《隐私政策》收集、保存、使用、共享、披露及保护您的个人信息。我们希望通过本《隐私政策》向您介绍我们对您个人信息的处理方式，因此我们再次建议您认真完整地阅读本《隐私政策》的所有条款。</h3>
      <h3>本《隐私政策》中所述的“药葫芦”软件及相关服务有可能会根据您所使用的手机型号、系统版本、软件应用程序版本等因素而有所不同。最终的产品和服务以您所使用的“药葫芦”软件及相关服务为准。</h3>
    </div>
    <div class="paragraph">
      <h2>本隐私政策将帮助您了解以下内容：</h2>
      <h3>1、本《隐私政策》的适用范围</h3>
      <h3>2、个人信息可能收集的范围与方式</h3>
      <h3>3、个人信息可能的使用方式</h3>
      <h3>4、个人信息安全与存储</h3>
      <h3>5、个人信息的管理</h3>
      <h3>6、未成年人信息的保护</h3>
      <h3>7、本《隐私政策》的变更</h3>
      <h3>8、联系我们</h3>
    </div>
    <div class="paragraph">
      <h2>1、本《隐私政策》的适用范围</h2>
      <h3>1.1本《隐私政策》适用于我们向您提供的“药葫芦”软件及相关服务，无论上述软件及服务是您通过计算机设备、移动设备或其他终端设备获得。</h3>
      <h3>1.2除本《隐私政策》另有规定外，本《隐私政策》所用词语与《“药葫芦”用户协议》所定义的词语具有相同的涵义。</h3>
      <h3>1.3本《隐私政策》不适用于以下情况：</h3>
      <p>（1）通过“药葫芦”软件及相关服务而接入的第三方服务（包括任何第三方应用及网站）收集的信息；</p>
      <p>（2）通过在“药葫芦”软件及相关服务中进行广告服务的其他公司或机构、组织所收集的信息。</p>
      <p>（3）公司的服务可能包括或链接至第三方提供的信息或其他服务（包括网站）。该等第三方服务可能由相关的第三方运营。您使用该等第三方服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非本隐私政策）约束，您需要仔细阅读其条款。请您妥善保护自己的个人信息，仅在必要的情况下向他人提供。本隐私政策仅适用于公司所收集、保存、使用的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，公司对任何第三方使用由您提供的信息不承担任何责任。</p>
    </div>
    <div class="paragraph">
      <h2>2、个人信息可能收集的范围与方式</h2>
      <h3>我们提供“药葫芦”软件及相关服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为药葫芦的用户或无法享受公司提供的某些服务，或者无法达到相关服务拟达到的效果。</h3>
      <h3>2.1您向我们提供的信息</h3>
      <h3>2.1.1您理解并同意，当您使用“药葫芦”软件及相关服务时，您可能将需要填写和/或提供的信息，可能包括姓名、性别、联系方式（如手机号码）等单独或者结合识别用户身份的信息。手机号码属于个人敏感信息，收集此类信息是为了满足相关法律法规的要求。若您不提供这类信息，你可能无法正常使用我们的服务。另外，您可以选择不提供某一或某些信息，但是这样可能使您无法使用“药葫芦”的相关特殊服务。</h3>
      <h3>2.1.2当您以其他方式关联登录、使用“药葫芦”软件及相关服务时，我们会向第三方请求您的个人信息（例如您授权共享的第三方社交账户信息（如头像、昵称等）），并在您同意本协议后将您的第三方社交账户与您的药葫芦账户绑定，使您可以通过第三方社交账户直接登录并使用“药葫芦”产品及相关服务。对于我们需要但第三方无法提供的个人信息，我们仍会要求您提供。如果您拒绝提供，将可能导致您无法正常使用“药葫芦”软件及相关服务的某些功能。</h3>
      <h3>2.2因您使用“药葫芦”软件及相关服务获取的信息。</h3>
      <h3>2.2.1日志信息。</h3>
      <p>（1）当您使用“药葫芦”产品或服务时，为使您获得更轻松的访问体验，公司可能会使用各种技术来收集和存储信息，在此过程中可能会向您的设备发送一个或多个Cookie或匿名标识符。这么做是为了了解您的使用习惯，使您省去重复输入注册信息等步骤，或帮助判断您的账户安全。</p>
      <p>（2）当您使用“药葫芦”产品或服务时，公司可能会利用Cookie和同类技术收取您的信息用于了解您的偏好，进行咨询或数据分析，改善产品服务即用户体验，提高广告效果，及时发现并防范安全风险，为用户和合作伙伴提供更好的服务。</p>
      <p>（3）公司不会将Cookie用于本隐私政策所述目的之外的任何用途，您可以根据自己的偏好留存或删除Cookie。您可清除软件或网页中保存的所有Cookie，当您手动清除后，您的相关信息即已删除。</p>
      <h3>2.2.2设备或应用信息。</h3>
      <p>当您使用“药葫芦”软件及相关服务时，我们会自动收集您的某些移动设备或应用包含的唯一应用程序编号。例如您使用的移动设备、浏览器或您使用的用于接入“药葫芦”服务的其他程序所提供的配置信息、设备版本号和设备识别码、IP地址等。</p>
      <p>为了提供更好的服务与改善用户体验，公司可能会记录硬件型号、操作系统版本号、国际移动设备身份码（IMEI）、网络设备硬件地址（MAC）等信息。</p>
      <h3>2.2.3位置信息。</h3>
      <p>当您选择开启设备定位功能并使用“药葫芦”基于位置提供的相关服务时，系统会通过GPS或WLAN等方式自动处理有关设备的位置信息（包括IP地址、GPS信号以及能够提供相关位置信息的其他传感器信息等），以使得您不需要手动输入自身地理坐标就可获得相关服务。为了提升您的体验，我们也可能会通过位置信息用以为您提供更具有个性化的服务，在征得您的同意后，将可能用于向您推荐距离您位置更近或更方便的药店或药柜。基于位置形成的精确定位信息属于个人敏感信息，拒绝提供该信息仅会使您无法使用上述功能，但不影响你正常使用“药葫芦”软件及相关服务的其他功能。您可以通过关闭定位功能，停止“药葫芦”软件对您的地理位置信息的收集（大多数移动设备将允许您关闭定位服务，具体建议您联系您的移动设备的服务商或生产商）。</p>
      <h3>2.2.4商品收货信息。</h3>
      <p>当您使用“药葫芦”软件及相关商品购买服务时，我们会收集您的收货信息，其中包括如，姓名、公司名称、家庭地址、电话、手机号码、个人/单位纳税号等。</p>
      <h3>2.2.5第三方获得的账号信息。</h3>
      <p>在获得您的同意后，我们可能从第三方获取您授权共享的账户信息（如头像、昵称等），并在您同意本《隐私政策》后将您的第三方账户与您的药葫芦账户绑定，使您可以通过第三方账户直接登录并使用“药葫芦”产品及相关服务。我们将会依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律法规规定的前提下，使用从第三方获得的您的个人信息。</p>
      <h3>2.2.6搜索或浏览信息。</h3>
      <p>当您使用“药葫芦”的搜索/浏览服务时，我们会收集您的搜索/浏览关键字信息、设备信息等。为了提供高效的搜索/浏览服务，部分前述信息会暂时存储在您的本地存储设备之中。您理解并同意，如您的搜索/浏览关键字信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上的个人信息，因此我们有权以其他的目的对其进行使用；只有当您的搜索/浏览关键字信息可以单独或结合其他信息识别到您的个人身份时，则在结合使用期间，我们会将您的搜索/浏览关键字信息作为您的个人信息，与您的搜索/浏览历史记录一同按照本《隐私政策》对其进行处理与保护。</p>
      <h3>2.2.7身份认证信息。</h3>
      <p>在您使用“药葫芦”软件及相关服务提供的身份认证/实名认证功能时，我们会根据相关法律法规规定和/或该身份认证功能所必需，收集您的姓名、身份证号等有关身份证明的信息，我们将对您的这些信息会加以最大程度的保护，如果您不提供这些信息，您将可能无法获得相关服务。</p>
    </div>
    <div class="paragraph">
      <h2>3、个人信息可能的使用方式</h2>
      <h3>3.1通过使用收集的信息，公司会得以向您提供个性化的服务并改善现有服务。</h3>
      <h3>3.2通过使用收集的信息，向您提供更加相关商品推荐以替代普遍展示的商品。</h3>
      <h3>3.3公司可能会与药葫芦关联公司、控制公司及其他合作方共同向您提供您所要求的服务或内容。在服务或内容为该项产品/服务所必须的情况下，您同意公司可与其分享您的个人信息，并且公司将努力确保该第三方在使用您的个人信息时同时遵守本隐私政策以及其他的保密及安全义务。</h3>
      <h3>3.4 您同意公司与如下第三方共享信息：</h3>
      <p>（1）软件服务提供商、智能设备提供商或系统服务提供商。当第三方软件、设备、系统与“药葫芦”产品及相关服务结合为您提供基于位置的服务时，我们可能会基于您对系统定位的授权及设定，收集您的位置信息及相关设备信息（例如硬件型号、操作系统版本号、国际移动设备身份识别码（IMEI）、网络设备硬件地址（MAC））并提供给前述提供商，特殊情境下会包含您另行填写的其他信息。如您拒绝此类信息的收集及使用，您可以在设备系统中进行设置或关闭提供服务的软件。</p>
      <p>（2）广告服务提供商。未经您授权，我们不会将您的个人信息与广告服务提供商进行共享。但我们可能会将难以识别您个人身份的用户画像标签与广告服务商共享，以帮助其在不识别您个人身份的前提下提升广告有效触达率。例如，只有在广告主同意遵守我们的广告发布规范后，我们才可能会告诉广告主他们广告的效果如何，或者有多少人看了他们广告或在看到广告后安装了应用，或者向这些合作伙伴提供不能识别个人身份的统计信息（例如“女性，25-29岁，位于北京”），帮助他们了解其受众或顾客。</p>
      <h3>3.5公司不对外公开或向第三方提供用户的个人信息，但下列情况除外：</h3>
      <p>（1）事先获得您的明确授权；</p>
      <p>（2）您分享的信息；</p>
      <p>（3）根据有关的法律法规或按照司法、行政等国家机关的要求；</p>
      <p>（4）出于实现我们对您个人信息合理使用的目的，或为履行本协议相关条款的规定或本隐私政策中的义务和行使我们的权利，向公司的关联方、合作伙伴或代表公司履行某项职能的第三方（例如代表我们发出推送通知的通讯服务商等）分享您的个人信息；</p>
      <p>（5）以维护公共利益或学术研究为目的；</p>
      <p>（6）为维护“药葫芦”其他用户、公司及其关联公司、控制公司、继承公司的合法权益，例如查找、预防、处理欺诈或安全方面的问题；</p>
      <p>（7）公司为维护合法权益而向用户提起诉讼或仲裁；</p>
      <p>（8）在涉及合并、分立、收购、资产转让或类似的交易时，如涉及到个人信息转让，公司会要求新的持有您的个人信息的公司、组织继续受本隐私政策的约束或按照法律法规及不低于本协议所要求的安全标准继续保护您的个人信息，否则，公司有权要求该公司、组织重新取得您的授权同意；</p>
      <p>（9）符合本用户协议相关条款的规定。</p>
    </div>
    <div class="paragraph">
      <h2>4、个人信息安全与存储</h2>
      <h3>4.1.公司非常重视信息安全，公司努力为您的信息安全提供保障，以防止您的信息被不当使用或被未经授权的访问、使用或泄漏。公司将在合理和安全水平内使用各种安全保护措施，例如公司会使用加密技术（例如SSL）、匿名化处理等手段保护您的个人信息。此外，公司将建立专门的数据安全部门、安全管理制度、采取流程保障您的个人信息安全。采取严格的数据使用和访问制度，采取专门的数据和技术安全审计。</h3>
      <h3>4.2我们依照法律法规的规定，将在境内运营过程中收集和产生的您的个人信息存储于中华人民共和国境内。</h3>
      <h3>4.3请您注意，除非您删除或撤回同意（即通过系统设置拒绝我们的收集和使用），您在使用“药葫芦”软件及相关服务时所提供的所有个人信息，将在您使用“药葫芦”软件及相关服务期间持续授权我们在符合本协议的范围内使用。我们仅在为提供“药葫芦”软件及服务之目的所必需的期间内保留您的个人信息，超出期限后我们会对您的个人信息进行删除或匿名化处理，但法律法规另有规定的除外。</h3>
      <h3>4.4对个人信息泄露等安全事件，公司会启动应急预案，阻止安全事件扩大。一旦发生用户信息安全事件（泄露、丢失等）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以推送通知、邮件、信函、短信等形式告知您，难以逐一告知时，我们会采取合理、有效的方式发布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。</h3>
      <h3>4.5尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入公司的服务所用的系统和通讯网络，有可能因公司可控范围外的因素而出现问题。因此，您应采取积极措施保护个人信息的安全，如：定期修改密码，不将自己的账号密码等个人信息透露给他人。</h3>
      <h3>4.6您知悉：“药葫芦”提供的个人信息保护措施仅适用于“药葫芦”平台，一旦您离开“药葫芦”，浏览或使用其他网站、服务及内容资源，“药葫芦”即没有能力及义务保护你在“药葫芦”之外的网站提交的任何个人信息，无论你登录或浏览上述网站是否基于“药葫芦”的链接或引导。</h3>
    </div>
    <div class="paragraph">
      <h2>5、个人信息的管理</h2>
      <h3>5.1 公司非常重视您对个人信息的管理，并尽全力保护您对于您个人信息的访问、修改（更新或更正）、删除以及撤回同意的权利，以使您拥有充分的能力保障您的隐私和安全。</h3>
      <h3>5.2当您完成“药葫芦”的账号注册、登录并进行合理和必要的身份验证后，您可以查阅、修改、删除您提交给“药葫芦”软件及相关服务的个人信息。您理解并同意，一般情况下，您可以在客户端应用程序中点击右下方的【我的】进入个人中心，通过【账号管理】随时浏览、修改自己提交的账号相关信息，但出于安全性和身份识别的考虑，您可能无法自主修改注册时提交的某些初始注册信息；如您确有必要修改该类信息，请您通过个人中心的【意见反馈】或【帮助&客服】-【在线客服】联系我们，公司将尽快审核所涉问题，并由专人验证您的用户身份后及时予以回复。</h3>
      <h3>5.3 您可以通过删除信息、关闭设备功能、在“药葫芦”客户端应用程序中通过【我的】-【设置】-【账号管理】，改变您“第三方登陆”等功能和服务中授权公司继续收集个人信息的范围或撤回您的授权。请您理解，特定的业务功能和服务将需要您的信息才能得以完成，当您撤回同意或授权后，公司无法继续为您提供撤回同意或授权所对应的功能和服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响公司此前基于您的授权而开展的个人信息处理。</h3>
      <h3>5.4 您的信息有以下情形之一时，按照法律法规要求，我们可能无法响应您的请求：</h3>
      <p>（1）与国家安全、国防安全有关的；</p>
      <p>（2）与公共安全、公共卫生、重大公共利益等有关的；</p>
      <p>（3）与犯罪侦查、起诉、审判和执行判决等有关的；</p>
      <p>（4）有充分证据表明您存在主观恶意或滥用权利的；</p>
      <p>（5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；</p>
      <p>（6）涉及商业秘密的；</p>
      <p>（7）其他法律法规规定的情形。</p>
      <h3>5.5如我们停止运营，我们将及时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对所持有的您的个人信息进行删除或匿名化处理。</h3>
    </div>
    <div class="paragraph">
      <h2>6、未成年人信息的保护</h2>
      <h3>我们非常重视对未成年人（依照现行法律的定义）个人信息的保护。我们不希望未成年人直接使用本软件提供的产品或服务，我们希望未成年人与其监护人一起，或在监护人的监督下使用本软件的产品或服务。</h3>
      <h3>我们既不主动寻求、也不希望收到直接来自未成年人的个人信息；但我们无法保证时刻都能准确地了解到访问或使用本软件的访问者年龄。 如果未成年人在无监护人同意的情况下向我们提供了他/她的个人信息，我们建议他/她的监护人与我们联系以删除该信息，并且通知我们以后不再向该未成年人发送任何信息。</h3>
    </div>
    <div class="paragraph">
      <h2>7、本《隐私政策》的变更</h2>
      <h3>在中国法律允许的范围内，我们可能会不时更新本《隐私政策》，恕不提前通知。我们将在“药葫芦”应用程序客户端和官方网站发出更新版本，并在更新后的条款生效前以适当的方式提醒您更新的内容，以便您及时了解本《隐私政策》的最新版本。</h3>
    </div>
    <div class="paragraph">
      <h2>8、联系我们</h2>
      <h3>如对本《隐私政策》内容有任何疑问、意见或建议，您可通过“药葫芦”客户端内的“意见反馈”或拨打客服电话400-0333888与我们联系。</h3>
    </div>
  </div>
  <div class="copyright">
    <div>互联网药品信息服务资格证书编号（粤ICP备15012374）-经营性-2018-0180</div>
    <div>Copyright 2018 康美药业股份有限公司. All rights reserved. 粤ICP证 10204402号-6</div>
  </div>
</div>
</template>

<script>
</script>

<style lang="less" scoped>
.PrivacyPolicy{
  position: absolute;
  top: 0;
  bottom: 0;;
  left: 0;
  right: 0;
  background: #ffffff;
  h1{
    height: 50px;
    line-height: 50px;
    text-align: center;
    color: #000;
    font-size: 20px;
  }
  // padding-top: 44px;
  .PrivacyPolicy-main{
    padding: 0.1px 12px;
    .paragraph{
      margin-top: 15px;
      h2{
        font-size: 14px;
        color: #000;
      }
      h3{
        text-indent:5px;
        font-size: 12px;
        color: #6d6d6d;
      }
      p{
        text-indent:10px;
        font-size: 12px;
        color: #6d6d6d;
      }
    }
  }
  .copyright{
    padding:50px 10px;
    >div{
      text-align: center;
      line-height: 20px;
      font-size: 12px;
      color: #6d6d6d;
    }
  }
}
</style>